#!/usr/bin/env python3
dic_info = ({'城市': '呼和浩特', '风力': '西南风微风', '温度': '20℃/31℃', '日期&天气': '7月10日 小雨转中雨',
              '日期&时间': '2016-7-10 17:54:20',
              '天气预报': '今日天气实况：气温：30℃；风向/风力：西南风 3级；湿度：42%；紫外线强度：弱。空气质量：良。', '省份': '内蒙古'},
             {'风力': '西北风微风', '温度': '18℃/26℃', '日期&天气': '7月11日 中雨转多云'},
             {'风力': '北风微风', '温度': '17℃/27℃', '日期&天气': '7月12日 多云'}, '呼和浩特')

print('今天详细天气预报：')
li = ['日期&天气', '温度', '风力']
print(dic_info[0]['省份'], dic_info[0]['城市'])
str_date = '{}{:>20}{:>}'.format(dic_info[0]['日期&时间'], dic_info[0]['日期&天气'], dic_info[0]['温度'])
print(str_date)
print(dic_info[0]['天气预报'])
for i, j in enumerate(li):
    if i >= 1:
        str_date = '{}                   {}'.format(dic_info[1][j], dic_info[2][j])
    else:
        str_date = '{}{:>19}'.format(dic_info[1][j], dic_info[2][j])
    print(str_date)